{
  "format": "layers-model",
  "generatedBy": "keras v3.5.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_51",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 82],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_12"
            },
            "name": "input_layer_12",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 82],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_14"
            },
            "name": "input_layer_14",
            "inbound_nodes": []
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_shape": [null, 82],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_13"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_18",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_12",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "rate": 0.3,
                    "seed": null,
                    "noise_shape": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_19",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_13",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "rate": 0.3,
                    "seed": null,
                    "noise_shape": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_20",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                }
              ],
              "build_input_shape": [null, 82]
            },
            "name": "sequential_6",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 82],
                      "dtype": "float32",
                      "keras_history": ["input_layer_12", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_shape": [null, 82],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_15"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_21",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_14",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "rate": 0.3,
                    "seed": null,
                    "noise_shape": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_22",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_15",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "rate": 0.3,
                    "seed": null,
                    "noise_shape": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_23",
                    "trainable": true,
                    "dtype": {
                      "module": "keras",
                      "class_name": "DTypePolicy",
                      "config": { "name": "float32" },
                      "registered_name": null
                    },
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": { "seed": null },
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                }
              ],
              "build_input_shape": [null, 82]
            },
            "name": "sequential_7",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 82],
                      "dtype": "float32",
                      "keras_history": ["input_layer_14", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "function": {
                "class_name": "__lambda__",
                "config": {
                  "code": "4wEAAAAAAAAAAAAAAAEAAAAEAAAAQwAAAHMQAAAAdABqAWoCfABkAWQCjQJTACkDTukBAAAAKQHa\nBGF4aXMpA9oCdGbaBG1hdGjaDGwyX25vcm1hbGl6ZSkB2gF4qQByBwAAAPogPGlweXRob24taW5w\ndXQtMTQzLTI1YWE1OWQ1MzhjNz7aCDxsYW1iZGE+GgAAAHMCAAAAEAA=\n",
                  "defaults": null,
                  "closure": null
                }
              },
              "output_shape": [32],
              "arguments": {}
            },
            "name": "lambda_6",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["sequential_6", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "function": {
                "class_name": "__lambda__",
                "config": {
                  "code": "4wEAAAAAAAAAAAAAAAEAAAAEAAAAQwAAAHMQAAAAdABqAWoCfABkAWQCjQJTACkDTukBAAAAKQHa\nBGF4aXMpA9oCdGbaBG1hdGjaDGwyX25vcm1hbGl6ZSkB2gF4qQByBwAAAPogPGlweXRob24taW5w\ndXQtMTQzLTI1YWE1OWQ1MzhjNz7aCDxsYW1iZGE+IgAAAHMCAAAAEAA=\n",
                  "defaults": null,
                  "closure": null
                }
              },
              "output_shape": [32],
              "arguments": {}
            },
            "name": "lambda_7",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["sequential_7", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "Dot",
            "config": {
              "name": "dot_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axes": 1,
              "normalize": false
            },
            "name": "dot_3",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 32],
                        "dtype": "float32",
                        "keras_history": ["lambda_6", 0, 0]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 32],
                        "dtype": "float32",
                        "keras_history": ["lambda_7", 0, 0]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          }
        ],
        "input_layers": [
          ["input_layer_12", 0, 0],
          ["input_layer_14", 0, 0]
        ],
        "output_layers": [["dot_3", 0, 0]]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "MeanSquaredError",
        "config": {
          "name": "mean_squared_error",
          "reduction": "sum_over_batch_size"
        }
      },
      "loss_weights": null,
      "metrics": ["mse"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "sequential_6/dense_18/kernel",
          "shape": [82, 256],
          "dtype": "float32"
        },
        {
          "name": "sequential_6/dense_18/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "sequential_6/dense_19/kernel",
          "shape": [256, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential_6/dense_19/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential_6/dense_20/kernel",
          "shape": [128, 32],
          "dtype": "float32"
        },
        {
          "name": "sequential_6/dense_20/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_21/kernel",
          "shape": [82, 256],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_21/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_22/kernel",
          "shape": [256, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_22/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_23/kernel",
          "shape": [128, 32],
          "dtype": "float32"
        },
        {
          "name": "sequential_7/dense_23/bias",
          "shape": [32],
          "dtype": "float32"
        }
      ]
    }
  ]
}
